// © Copyright 2004-2012, 2015-2017 HP Development Company, L.P.

// Text fields' values
PrinterStatusTitleTextFieldValue = "Device Status:";
SuppliesTitleTextFieldValue = "Supplies:";
PrinterNameTitleTextFieldValue = "Printer Name:";
ModelTitleTextFieldValue = "Model Name:";

//Control titles
DeviceOKButtonTitle = "OK";
DeviceResumeButtonTitle = "Resume";
SupplyInfoTaskTitle = "Supply Info";
TravelInfoTaskTitle = "Travel Info";

InkStatusConsumableForAnotherPrinter = "Genuine HP cartridge for another printer";
UnexpectedInstantInkInstalledName = "Unexpected Instant Ink Installed";
HPIICartridgeInstalled = "HP Instant Ink Cartridge Installed";

// Device states
IdleName = "Idle";
BusyName = "Busy";
InitializingName = "Initializing";
PrintingName = "Printing";
WarmupName = "Warming Up";
ReportsPrintingName = "Reports printing";
CancelingName = "Canceling…";
CalibratingName = "Calibrating…";
ScanningName = "Scanning…";
FaxDialingName = "Fax Dialing…";
FaxProblemName = "Fax problem";
FaxProcessingName = "Fax Processing…";
FaxConnectingName = "Fax Connecting…";
FaxSendingName = "Fax Sending…";
FaxReceivingName = "Fax Receiving…";
FaxBlockingName = "Fax Blocking…";
FaxCommunicationErrorName = "Fax Communication Error";
CopyingName = "Copying";
IOStallName = "IO stall";
GeneralPrinterError = "General Printer Error";
PrinterErrorName = "Printer Error";
PrinterFailure = "Printer Failure";
PrintSystemProblemName = "Problem with Print System";
PrinterProblemName = "Printer Problem";
PrintingInQuietModeName = "Printing in Quiet Mode";
CopyingInQuietModeName = "Copying in Quiet Mode";
PaperSizeMismatchName = "Paper size mismatch";
PaperSizeMismatchTitle = "Paper size mismatch";
QuietModeIgnoredName = "Quiet Mode Temporarily Disabled";
ActionRequired = "Action Required";

DeviceStatusUnknown = "Unknown";

FeederJammedOrDirtyName = "Document feeder jammed or dirty";

DiaperFullWarning = "Ink Service Capacity Warning";

DryTimeWaitName = "Dry time wait";
DryTimeWaitTitle = "Dry time wait";
DryTimeWaitMsg = "The device has paused to let the ink dry.\nIf this is an automatic two-sided print job, please do not remove the paper. The paper will be pulled back into the device to print the second side.";

CDopenTitle = "CD/DVD tray is open";
CDopenMsg = "Please close the CD/DVD tray to continue printing from the Main tray.";

CDclosedTitle = "CD/DVD tray is closed";
CDclosedMsg = "Please open the CD/DVD tray to continue CD printing.";

PenChangeName = "Pen change";
BannerEjectNeededName = "Banner eject needed";
BannerMismatchName = "Banner mismatch";
PhotoMismatchName = "Photo mismatch";
DuplexMismatchName = "Duplex mismatch";

CarriageStallName = "Carriage stall";
CarriageStallTitle = "The carriage is stalled";
CarriageStallMsg = "The print cartridge cradle cannot move.\nPlease turn device power off. Check device for a paper jam or other obstruction.";
InkCarriageStallName = "Ink cartridge carriage stalled";

PrintBarStallName = "Print bar stall";

PaperStallName = "Paper stall";

PenFailureName = "Pen failure";
PrintheadFailedOrMissedName = "Missing or failed printhead";
ProblemWithPrintheadName = "Problem with printhead";
InkSystemFailureName = "Ink System Failure";
InkCartridgeFailureName = "Ink cartridge failure";
CartridgeProblemName = "Cartridge Problem";
IncompatibleCartridgesName = "Incompatible Cartridges";
IncompatibleInkCartridgesName = "Incompatible ink cartridges";
IncompatibleTonerName = "Incompatible Cartridge";
IncompatibleDrumName = "Incompatible Drum";
CartridgeInWrongOrderName = "Ink cartridge incorrectly installed";
InkCartridgesMissingName = "Ink cartridges missing";
InkCartridgeProblemName = "Ink cartridge problem";
HPProtectedCartridgeInstalledName = "HP Protected Cartridge Installed";
HPProtectedDrumInstalledName = "HP Protected Drum Installed";
UsedHPInstantInkCartridge = "HP Instant Ink cartridge listed above can only be used in the HP Instant Ink printer that initially installed the cartridge and must be replaced.";
UsedHPInstantInkCartridgeTitle = "Used HP Instant Ink Cartridge";
TrialConsumableCountExceededName = "Unsupported Cartridge Installed";
ReplaceFaultySupplyTitle = "Replace faulty ink cartridge or printhead.";
ReplaceFaultySupplyMsg = "A serious problem was detected with one of the ink cartridges or printheads. Replace with an HP ink cartridge or printhead.";
CommunicationFailureName = "Communication Failure";
ConsumableSubscriptionOptionNotSetName = "Finish Printer Setup";
NonInstantInkCartridgeInstalledName = "Non-Instant Ink Cartridge Installed";
InstantInkReadyCartridgesInstalledName = "HP Instant Ink Ready Cartridges Installed";
PHAStartupBlockedName = "Use New Cartridges for Startup";
UsedCartridgeNotRecommendedForStartupName = "Used Cartridge Not Recommended for Startup";
PHAStartupFailedName = "Printhead Failure";
SetupSupplyUpgradeFailedName = "Problem with SETUP cartridges";
CartridgeSensorFailureName = "Cartridge Sensor Failure";
CartridgeSensorErrorName = "Cartridge Sensor Error";
SHAIDOOITooEarlyFailureName = "Supply System Problem";
InsufficientPrinterMemoryName = "Insufficient Printer Memory";
TonerMemoryMissingName = "Cartridge Memory Appears to be Missing";
DrumMemoryMissingName = "Drum Memory Appears to be Missing";
UnauthorizedDrumName = "Unauthorized Drum";
PrinterMaintenanceName = "Printer Maintenance";
PrinterMispickName = "Printer Mispick";
WrongCartridgeInSlotName = "Wrong cartridge in slot";
ManuallyFeedName = "Manually feed paper";
PrintOnBothSidesName = "Manual duplex";
ReplaceCartridgePrintingBlackName = "Replace Cartridge Printing Black";
OverFilledDetectionName = "Loaded too much paper";

HSDOlderGenerationCartridgeTitle = "Older generation cartridge installed";

HardErrorName = "Hard error";
InstallFuserName = "Turn off. Reinstall fuser.";
PoweringDownName = "Powering down";
FPTestName = "FP test";
HydeMissingName = "Hyde missing";
OutputBinFullName = "Output bin full";
MediaSizeMismatchName = "Media size mismatch";
ManualDuplexBlockName = "Manual duplex block";
ServiceStallName = "Service stall";
ServiceStationStalledName = "Service Station Stalled";
MediaTooShortToPrintName = "Paper too short";
MediaTooShortToAutoDuplexName = "Paper too short to auto-duplex";
MediaTooLongToAutoDuplexName = "Paper too long to auto-duplex";
MediaPromptName = "Media prompt";

ScannerUnknownErrorName = "Scanner unknown error";
ScannerInvalidMediaSizeName = "Scanner media size mismatch";
ScannerFeederOpenName = "Automatic Document Feeder cover open";
ScannerFeederJamName = "Paper Jam in Automatic Document Feeder";
ScannerFeederEmptyName = "Document feeder empty";
ScannerFeederLoadedName = "Document loaded";
ScannerMispickName = "ADF Misfeed";
ScannerProcessingName = "Scan processing";
ScannerFeederJamOrDirtyName = "ADF jammed or dirty";

OutOfInkName = "Out of ink";
OutOfInkTitle = "Ink Cartridge(s) Empty";
OutOfInkMsg = "No ink is available for printing.\nYou must install at least one of the primary color supplies or the black supply to continue printing.";
CartridgeVeryLowName = "Very low on ink";

LIOProtoErrorName = "LIO proto error";
PumpStallName = "Pump stall";
Tray2MissingName = "Tray 2 missing";
TrayAlmostEmptyName = "Low on Paper";
DuplexerMissingName = "Duplexer missing";
RearTrayMissingName = "Rear tray missing";
PenNotLatchedName = "Pen not latched";
ManualFeedBlockName = "Manual feed block";
TrayMissingName = "Paper Tray Missing";
TrayMissingOrOpenName = "Tray Missing or Open";
InputTrayFailedToOpenName = "Paper Tray Blocked";

NonHPInkName = "Non HP Ink";
NonHPInkTitle = "Non-HP Ink Cartridge(s)";
NonHPInkMsg = "HP cannot guarantee the quality or reliability of non-HP supplies. Printer service or repairs required as a result of using a non-HP supply will not be covered under warranty.\nIf you believe you purchased a genuine HP print cartridge, visit us at: www.hp.com/go/anticounterfeit.\nGenuine HP supplies are designed and tested with HP printers to help you easily produce great results, time after time.";
NonHPInkRecoverableMsg = "HP recognizes customer’s choice, but cannot guarantee the quality or reliability of non-HP ink cartridges. Printer services or repairs required as a result of using non-HP ink cartridges will not be covered under warranty. To continue printing with non-HP ink cartridge, press and hold Power button, press Resume button three times, and release Power button. However, print quality and ink level information may be affected. Otherwise, replace with HP ink cartridge(s). If you believe you have purchased a genuine HP ink cartridge, visit www.hp.com/go/anticounterfeit.";

PPCResumeName = "PPC Resume";
MediaTypeMismatchName = "Media type mismatch";
CustomMediaMismatchName = "Custom media mismatch";
PenCleaningName = "Pen cleaning";
PenCheckingName = "Pen checking";
ParsingName = "Parsing";
DryingMediaName = "Drying media";
AccessingPensName = "Accessing pens";
AligningPensName = "Aligning pens";
LoadingMediaName = "Loading media";
UnloadingMediaName = "Unloading media";
NestingPlotsName = "Nesting plots";
ReplacingPrintKitName = "Replacing print kit";
GoingOnName = "Going On";
TransitionName = "Transition";
PanelAccessName = "Front Panel Accessed";

ParserErrorName = "Parser error";
PenMissingName = "Pen missing";
IncorrectPenInstalledName = "Incorrect pen installed";
TrayMediaJamName = "Tray media jam";
MediaUnavailableName = "Media unavailable";
UnknownMediaName = "Unknown media";
MediaLevelInWrongPositionName = "Media level in wrong position";
MediaMisalignedName = "Media misaligned";
MediaInWrongFormatName = "Media in wrong format";
MediaMispositionedName = "Media mispositioned";
MediaEdgeNotDetectedName = "Media edge not detected";
InkSupplyMissingName = "Ink supply missing";
IncorrectInkSupplyInstalledName = "Incorrect ink supply installed";
InkSharedAddressError = "Ink Cartridge Problem";
InkSupplyFailureName = "Ink supply failure";
PenCleanerMissingName = "Pen cleaner missing";
PenCleanerIncorrectName = "Pen cleaner incorrect";

UpgradableSupplyName = "Secure Upgrade Detected";
SupplyUpgradeSuccessName = "Secure Upgrade Successful";
SupplyUpgradeFailedName = "Secure Upgrade Not Successful";

SubscribedPagesLowName = "Subscribed Pages Low";
SubscribedPagesVeryLowName = "Very Low on Subscribed Pages";
SubscribedPagesOutName = "Out of Subscribed Pages";
SubscriptionNeedToConnectName = "Subscription Needs Connection";
SubscriptionSuccessfulName = "Ink Subscription Successful";
SubscriptionCancellationSuccessfulName = "Ink Subscription is Canceled";
SupplyNeedsEnrollmentName = "Instant Ink Enrollment Required";
NeedToOrderCartridgeName = "Need to Order Cartridge";
ImportantMessageName = "Important Message Available";

PhotoTrayProblemName = "Photo Tray Problem";
CriticalConditionName = "Attention Required";
CriticalConditionTitle = "Device requires your attention";
CriticalConditionMsg = "Please see the messages on the control panel for more information.";

OutputTrayClosedName = "Output tray closed";
OutputTrayClosedTitle = "Output tray closed";
OutputTrayClosedMsg = "The output tray must be open to print. Open the output tray.";

LowPaperTitle = "Paper level is low";
LowPaperMsg = "Please add some paper to the input tray.";
LowPaperName = "Low paper";

NoPaperName = "Out of paper";
NoPaperTitle = "Out of paper";
NoPaperMsg = "The device is out of paper. Please add some paper to the input tray.";
OutOfPaperTitle = "The device is out of paper";
OutOfPaperMsg = "Load more paper and press the $FrontPanelAcceptButton$ button on the device.";

TrayOpenTitle = "Paper tray is open";
TrayOpenMsg = "Please close all trays";
TrayOpenName = "Tray open";

DoorOpenTitle = "Door/Cover is open";
DoorOpenMsg = "The device cannot print because a cover is open. Please close all covers on the device.";
DoorOpenName = "Door/Cover is open";
FrontDoorOpenTitle = "Front Door Open";
FrontDoorOpenName = "Front Door Open";
RearDoorOpenTitle = "Rear Door Open";
RearDoorOpenName = "Rear Door Open";

CloseLeftDoorName = "Close Left Door";
CloseRightDoorName = "Close Right Door";
CloseLowerRightDoorName = "Close Lower Right Door";
DefectiveMemoryName = "Supply memory error";
DefectiveMemoryOnTonerName = "Supply Memory Error on Cartridge";
DefectiveMemoryOnDrumName = "Supply Memory Error on Drum";

JammedTitle = "Paper jam";
JammedMsg = "A paper jam has occurred. Locate the jammed paper and remove it.";
PaperJamTitle = "Paper Jam";
PaperJamMsg = "There is a paper jam (or misfeed). Clear the jam and press the $FrontPanelAcceptButton$ button on the device.";
PaperJamOrTrayProblemTitle = "Paper jam or tray problem";
RealTimeClockFailureName = "Problem with Printer Preparation";

ADFPickErrorTrayName = "Document feeder mispick";
ADFJammedTrayName = "Document Feeder jam";

CarriageJamTitle = "Carriage jam";
CarriageJamMsg = "A carriage jam has occurred. Locate the jammed paper and remove it.";
CarriageJamName = "Carriage jam";

PaperJamInTrayName = "Paper Jam in Tray";
PaperJamInFuserName = "Paper Jam in Fuser";
PaperJamInOutputTrayName = "Paper Jam in Output Tray";
PaperJamInDuplixerName = "Paper Jam in Duplexer";

OfflineTitle = "Device is Offline";
OfflineMsg = "Device is offline and cannot process print jobs.";
OfflineName = "Offline";

StartupRoutineFailedName = "Startup Routine Ink Alert";
CartridgeCounterfeitOrUsedName = "Used or Counterfeit Cartridge Detected";
SupplyCartridgeRefilledName = "Used, Refilled or Counterfeit Cartridge Detected";
CartridgeCounterfeitAdvisoryName = "Counterfeit Cartridge Advisory";

UnauthorizedSupplyName = "Unauthorized Cartridge";

CartridgeMissingOrPaperJamTitle = "Paper Jam Or Missing Black Cartridge";
CartridgeMissingOrPaperJamMsg = "Install black cartridge or clear jam, then open and close door.";
CartridgeMissingOrPaperJamName = "Paper Jam Or Missing Black Cartridge";

InsertSETUPCartridge = "Insert Setup Cartridge";
InsertNonSETUPCartridge = "Insert Non Setup Cartridge";

WaxSpittoonReplaceNeededTitle = "Replace ink service module immediately";
WaxSpittoonReplaceNeededMsg = "The ink service module is now full. When it is full, the printer will stop printing. If you have a replacement for the ink service module, replace it now by following the instructions that come with it. Otherwise, visit www.hp.com/support/dj460 or contact HP customer support to get a replacement. In the meantime, remove the right print cartridge to continue printing. The printer can print using only the color print cartridge but the color results and print speed may be affected.";
WaxSpittoonReplaceNeededName = "Wax spittoon is full";

IsmFullName = "ISM Full";
IsmFullTitle = "Ink Service Module is full";
IsmFullMsg = "Please replace the Ink Service Module immediately.";

PrintheadsServiceStatus = "Pen servicing";
PrintheadsServiceSupplies = "Printheads servicing";

PaperMismatchTitle = "Paper Mismatch";
PaperMismatchMsg = "Paper detected does not match paper size selected. Press $FrontPanelAcceptButton$ and then choose a different paper size or change the paper in the device.";
UnexpectedPaperSizeName = "Unexpected Paper Size";

BlackCartridgeMissingTitle = "Black print cartridge missing";
BlackCartridgeMissingMsg = "The black print cartridge was not detected in the printer because it was installed incorrectly, or is missing. The printer can print with a single print cartridge but the color results and print speed may be affected. If you have recently installed a print cartridge, make sure you have removed the protective film covering the cartridge's nozzle.";

BlackCartridgeMisinstalledName = "Black cartridge incorrectly installed";
BlackCartridgeMisinstalledTitle = "Black print cartridge incorrectly installed";
BlackCartridgeMisinstalledMsg = "There is a problem with the black print cartridge. To solve the problem:\n1. Remove the print cartridge.\n2. Reinsert the print cartridge.\nIf the problem persists, replace the print cartridge. If you do not have a replacement available to install when print quality becomes unacceptable, you may remove the print cartridge and print using only the remaining print cartridge. The printer may print more slowly, and printed colors may differ from those you would see with all print cartridges installed.";
BlackCartridgeMisinstalledShortMsg = "There is a problem with the black print cartridge. To solve the problem:\n1. Remove the print cartridge.\n2. Reinsert the print cartridge.\nIf the problem persists, replace the print cartridge.";
OnePenDeviceBlackCartridgeMisinstalledMsg = "There is a problem with the black print cartridge. To solve the problem:\n1. Remove the print cartridge.\n2. Reinsert the print cartridge.\nIf the problem persists, replace the print cartridge.";

BlackCartridgeIncorrectTitle = "Incorrect print cartridge";
BlackCartridgeIncorrectMsg = "There is a problem with the black print cartridge. At least one of the print cartridges currently installed is not intended for use in this printer. For more information on what print cartridge your printer can use, see the \"$SupplyInfoTask$\" screen.";

BlackCartridgeErrorName = "Problem with black cartridge";
BlackCartridgeErrorTitle = "Problem with the black print cartridge";
BlackCartridgeErrorMsg = "There is a problem with the black print cartridge. To solve the problem:\n1. Remove the print cartridge.\n2. Reinsert the print cartridge.\nIf the problem persists, replace the print cartridge. If you do not have a replacement available to install when print quality becomes unacceptable, you may remove the print cartridge and print using only the remaining print cartridge. The printer will print all documents in grayscale when using only the remaining print cartridge.";
BlackCartridgeErrorShortMsg = "There is a problem with the black print cartridge. To solve the problem:\n1. Remove the print cartridge.\n2. Reinsert the print cartridge.\nIf the problem persists, replace the print cartridge.";
OnePenDeviceBlackCartridgeErrorMsg = "There is a problem with the black print cartridge. To solve the problem:\n1. Remove the print cartridge.\n2. Reinsert the print cartridge.\nIf the problem persists, replace the print cartridge.";

ColorCartridgeMissingTitle = "Color print cartridge missing";
ColorCartridgeMissingMsg = "The color print cartridge was not detected in the printer because it was installed incorrectly, or is missing. The printer can print with a single print cartridge but the color results and print speed may be affected. If you have recently installed a print cartridge, make sure you have removed the protective film covering the cartridge's nozzle.";

ColorCartridgeMisinstalledName = "Color cartridge incorrectly installed";
ColorCartridgeMisinstalledTitle = "Color print cartridge incorrectly installed";
ColorCartridgeMisinstalledMsg = "There is a problem with the color print cartridge. To solve the problem:\n1. Remove the print cartridge.\n2. Reinsert the print cartridge.\nIf the problem persists, replace the print cartridge. If you do not have a replacement available to install when print quality becomes unacceptable, you may remove the print cartridge and print using only the remaining print cartridge. The printer may print more slowly, and printed colors may differ from those you would see with all print cartridges installed.";
ColorCartridgeMisinstalledShortMsg = "There is a problem with the color print cartridge. To solve the problem:\n1. Remove the print cartridge.\n2. Reinsert the print cartridge.\nIf the problem persists, replace the print cartridge.";
OnePenDeviceColorCartridgeMisinstalledMsg = "There is a problem with the color print cartridge. To solve the problem:\n1. Remove the print cartridge.\n2. Reinsert the print cartridge.\nIf the problem persists, replace the print cartridge.";

ColorCartridgeIncorrectTitle = "Incorrect print cartridge";
ColorCartridgeIncorrectMsg = "There is a problem with the color print cartridge. At least one of the print cartridges currently installed is not intended for use in this printer. For more information on what print cartridge your printer can use, see the \"$SupplyInfoTask$\" screen.";

ColorCartridgeErrorName = "Problem with color cartridge";
ColorCartridgeErrorTitle = "Problem with the color print cartridge";
ColorCartridgeErrorMsg = "There is a problem with the color print cartridge. To solve the problem:\n1. Remove the print cartridge.\n2. Reinsert the print cartridge.\nIf the problem persists, replace the print cartridge. If you do not have a replacement available to install when print quality becomes unacceptable, you may remove the print cartridge and print using only the remaining print cartridge. The printer will print all documents in grayscale when using only the remaining print cartridge.";
ColorCartridgeErrorShortMsg = "There is a problem with the color print cartridge. To solve the problem:\n1. Remove the print cartridge.\n2. Reinsert the print cartridge.\nIf the problem persists, replace the print cartridge.";
OnePenDeviceColorCartridgeErrorMsg = "There is a problem with the color print cartridge. To solve the problem:\n1. Remove the print cartridge.\n2. Reinsert the print cartridge.\nIf the problem persists, replace the print cartridge.";

PhotoCartridgeMissingTitle = "Photo print cartridge missing";
PhotoCartridgeMissingMsg = "The photo print cartridge was not detected in the printer because it was installed incorrectly, or is missing. The printer can print with a single print cartridge but the color results and print speed may be affected. If you have recently installed a print cartridge, make sure you have removed the protective film covering the cartridge's nozzle.";

PhotoCartridgeMisinstalledName = "Photo cartridge incorrectly installed";
PhotoCartridgeMisinstalledTitle = "Photo print cartridge incorrectly installed";
PhotoCartridgeMisinstalledMsg = "There is a problem with the photo print cartridge. To solve the problem:\n1. Remove the print cartridge.\n2. Reinsert the print cartridge.\nIf the problem persists, replace the print cartridge. If you do not have a replacement available to install when print quality becomes unacceptable, you may remove the print cartridge and print using only the remaining print cartridge. The printer may print more slowly, and printed colors may differ from those you would see with all print cartridges installed.";
PhotoCartridgeMisinstalledShortMsg = "There is a problem with the photo print cartridge. To solve the problem:\n1. Remove the print cartridge.\n2. Reinsert the print cartridge.\nIf the problem persists, replace the print cartridge.";
OnePenDevicePhotoCartridgeMisinstalledMsg = "There is a problem with the photo print cartridge. To solve the problem:\n1. Remove the print cartridge.\n2. Reinsert the print cartridge.\nIf the problem persists, replace the print cartridge.";

PhotoCartridgeIncorrectTitle = "Incorrect print cartridge";
PhotoCartridgeIncorrectMsg = "There is a problem with the photo print cartridge. At least one of the print cartridges currently installed is not intended for use in this printer. For more information on what print cartridge your printer can use, see the \"$SupplyInfoTask$\" screen.";

PhotoCartridgeErrorName = "Problem with photo cartridge";
PhotoCartridgeErrorTitle = "Problem with the photo print cartridge";
PhotoCartridgeErrorMsg = "There is a problem with the photo print cartridge. To solve the problem:\n1. Remove the print cartridge.\n2. Reinsert the print cartridge.\nIf the problem persists, replace the print cartridge. If you do not have a replacement available to install when print quality becomes unacceptable, you may remove the print cartridge and print using only the remaining print cartridge. The printer will print all documents in grayscale when using only the remaining print cartridge.";
PhotoCartridgeErrorShortMsg = "There is a problem with the photo print cartridge. To solve the problem:\n1. Remove the print cartridge.\n2. Reinsert the print cartridge.\nIf the problem persists, replace the print cartridge.";
OnePenDevicePhotoCartridgeErrorMsg = "There is a problem with the photo print cartridge. To solve the problem:\n1. Remove the print cartridge.\n2. Reinsert the print cartridge.\nIf the problem persists, replace the print cartridge.";

GrayCartridgeMisinstalledName = "Gray cartridge incorrectly installed";
GrayCartridgeMisinstalledTitle = "Gray print cartridge incorrectly installed";
GrayCartridgeMisinstalledMsg = "There is a problem with the gray print cartridge. To solve the problem:\n1. Remove the print cartridge.\n2. Reinsert the print cartridge.\nIf the problem persists, replace the print cartridge. If you do not have a replacement available to install when print quality becomes unacceptable, you may remove the print cartridge and print using only the remaining print cartridge. The printer may print more slowly, and printed colors may differ from those you would see with all print cartridges installed.";
GrayCartridgeMisinstalledShortMsg = "There is a problem with the gray print cartridge. To solve the problem:\n1. Remove the print cartridge.\n2. Reinsert the print cartridge.\nIf the problem persists, replace the print cartridge.";
OnePenDeviceGrayCartridgeMisinstalledMsg = "There is a problem with the gray print cartridge. To solve the problem:\n1. Remove the print cartridge.\n2. Reinsert the print cartridge.\nIf the problem persists, replace the print cartridge.";

GrayCartridgeErrorName = "Problem with gray cartridge";
GrayCartridgeErrorTitle = "Problem with the gray print cartridge";
GrayCartridgeErrorMsg = "There is a problem with the gray print cartridge. To solve the problem:\n1. Remove the print cartridge.\n2. Reinsert the print cartridge.\nIf the problem persists, replace the print cartridge. If you do not have a replacement available to install when print quality becomes unacceptable, you may remove the print cartridge and print using only the remaining print cartridge. The printer will print all documents in grayscale when using only the remaining print cartridge.";
GrayCartridgeErrorShortMsg = "There is a problem with the gray print cartridge. To solve the problem:\n1. Remove the print cartridge.\n2. Reinsert the print cartridge.\nIf the problem persists, replace the print cartridge.";
OnePenDeviceGrayCartridgeErrorMsg = "There is a problem with the gray print cartridge. To solve the problem:\n1. Remove the print cartridge.\n2. Reinsert the print cartridge.\nIf the problem persists, replace the print cartridge.";

LeftCartridgeMissingTitle = "Left print cartridge missing";
LeftCartridgeMissingMsg = "The left print cartridge was not detected in the printer because it was installed incorrectly, or is missing. The printer can print with a single print cartridge but the color results and print speed may be affected. If you have recently installed a print cartridge, make sure you have removed the protective film covering the cartridge's nozzle.";
LeftCartridgeMissingShortMsg = "The left print cartridge was not detected in the printer because it was installed incorrectly, or is missing. If you have recently installed a print cartridge, make sure you have removed the protective film covering the cartridge's nozzle.";
LeftCartridgeMissingName = "Left cartridge missing";

LeftCartridgeMisinstalledTitle = "Left print cartridge incorrectly installed";
LeftCartridgeMisinstalledMsg = "There is a problem with the left print cartridge. To solve the problem:\n1. Remove the print cartridge.\n2. Reinsert the print cartridge.\nIf the problem persists, replace the print cartridge. If you do not have a replacement available to install when print quality becomes unacceptable, you may remove the print cartridge and print using only the remaining print cartridge. The printer may print more slowly, and printed colors may differ from those you would see with all print cartridges installed.";
LeftCartridgeMisinstalledShortMsg = "There is a problem with the left print cartridge. To solve the problem:\n1. Remove the print cartridge.\n2. Reinsert the print cartridge.\nIf the problem persists, replace the print cartridge.";
LeftCartridgeMisinstalledName = "Left cartridge incorrectly installed";

LeftCartridgeIncorrectTitle = "Incorrect print cartridge";
LeftCartridgeIncorrectMsg = "There is a problem with the left print cartridge. At least one of the print cartridges currently installed is not intended for use in this printer. For more information on what print cartridge your printer can use, see the \"$SupplyInfoTask$\" screen.";
LeftCartridgeIncorrectName = "Incorrect print cartridge";

LeftCartridgeErrorTitle = "Problem with the left print cartridge";
LeftCartridgeErrorMsg = "There is a problem with the left print cartridge. To solve the problem:\n1. Remove the print cartridge.\n2. Reinsert the print cartridge.\nIf the problem persists, replace the print cartridge. If you do not have a replacement available to install when print quality becomes unacceptable, you may remove the print cartridge and print using only the remaining print cartridge. The printer will print all documents in grayscale when using only the remaining print cartridge.";
LeftCartridgeErrorShortMsg = "There is a problem with the left print cartridge. To solve the problem:\n1. Remove the print cartridge.\n2. Reinsert the print cartridge.\nIf the problem persists, replace the print cartridge.";
LeftCartridgeErrorName = "Problem with left cartridge";

LeftCartridgeExpiredTitle = "Cartridge has expired - Left";
LeftCartridgeExpiredMsg = "The following ink cartridge is past its expiration date: Left.\nYou should remove or replace the expired cartridge now, before closing this alert message, or click OK to continue with the expired ink cartridges.\nHP cannot guarantee the quality or reliability of expired ink cartridges.\nPrinter service or repairs required as a result of using expired ink cartridges will not be covered under warranty.";

LeftCartridgeNonHPTitle = "Cartridge is non-HP - Left";
LeftCartridgeNonHPMsg = "HP cannot guarantee the quality or reliability of non-HP supplies. Printer service or repairs required as a result of using a non-HP supply will not be covered under warranty.\nIf you believe you purchased a genuine HP print cartridge, visit us at: www.hp.com/go/anticounterfeit.\nGenuine HP supplies are designed and tested with HP printers to help you easily produce great results, time after time.";

LeftCartridgeLowTitle = "Cartridge is low - Left";
LeftCartridgeLowMsg = "The ink cartridge will need to be replaced soon. When the cartridge is empty, the printer will not print until the cartridge is replaced.";

LeftCartridgeOutTitle = "Cartridge is low - Right";
LeftCartridgeOutMsg = "Replace with a new HP ink cartridge. The printer will only print after the cartridge is replaced.";

RightCartridgeMissingTitle = "Right print cartridge missing";
RightCartridgeMissingMsg = "The right print cartridge was not detected in the printer because it was installed incorrectly, or is missing. The printer can print with only the color print cartridge but the color results and print speed may be affected. If you have recently installed a print cartridge, make sure you have removed the protective film covering the cartridge's nozzle.";
RightCartridgeMissingShortMsg = "The right print cartridge was not detected in the printer because it was installed incorrectly, or is missing. If you have recently installed a print cartridge, make sure you have removed the protective film covering the cartridge's nozzle.";
RightCartridgeMissingName = "Right cartridge missing";

RightCartridgeMisinstalledTitle = "Right print cartridge incorrectly installed";
RightCartridgeMisinstalledMsg = "There is a problem with the right print cartridge. To solve the problem:\n1. Remove the print cartridge.\n2. Reinsert the print cartridge.\nIf the problem persists, replace the print cartridge. If you do not have a replacement available to install when print quality becomes unacceptable, you may remove the print cartridge and print using only the remaining print cartridge. The printer may print more slowly, and printed colors may differ from those you would see with all print cartridges installed.";
RightCartridgeMisinstalledShortMsg = "There is a problem with the right print cartridge. To solve the problem:\n1. Remove the print cartridge.\n2. Reinsert the print cartridge.\nIf the problem persists, replace the print cartridge.";
RightCartridgeMisinstalledName = "Right cartridge incorrectly installed";

RightCartridgeIncorrectTitle = "Incorrect print cartridge";
RightCartridgeIncorrectMsg = "There is a problem with the right print cartridge. At least one of the print cartridges currently installed is not intended for use in this printer. For more information on what print cartridge your printer can use, see the \"$SupplyInfoTask$\" screen.";
RightCartridgeIncorrectName = "Incorrect print cartridge";

RightCartridgeErrorTitle = "Problem with the right print cartridge";
RightCartridgeErrorMsg = "There is a problem with the right print cartridge. To solve the problem:\n1. Remove the print cartridge.\n2. Reinsert the print cartridge.\nIf the problem persists, replace the print cartridge. If you do not have a replacement available to install when print quality becomes unacceptable, you may remove the print cartridge and print using only the remaining print cartridge. The printer will print all documents in grayscale when using only the remaining print cartridge.";
RightCartridgeErrorShortMsg = "There is a problem with the right print cartridge. To solve the problem:\n1. Remove the print cartridge.\n2. Reinsert the print cartridge.\nIf the problem persists, replace the print cartridge.";
RightCartridgeErrorName = "Problem with right cartridge";

RightCartridgeExpiredTitle = "Cartridge has expired - Right";
RightCartridgeExpiredMsg = "The following ink cartridge is past its expiration date: Right.\nYou should remove or replace the expired cartridge now, before closing this alert message, or click OK to continue with the expired ink cartridges.\nHP cannot guarantee the quality or reliability of expired ink cartridges.\nPrinter service or repairs required as a result of using expired ink cartridges will not be covered under warranty.";

RightCartridgeNonHPTitle = "Cartridge is non-HP - Right";
RightCartridgeNonHPMsg = "HP cannot guarantee the quality or reliability of non-HP supplies. Printer service or repairs required as a result of using a non-HP supply will not be covered under warranty.\nIf you believe you purchased a genuine HP print cartridge, visit us at: www.hp.com/go/anticounterfeit.\nGenuine HP supplies are designed and tested with HP printers to help you easily produce great results, time after time.";

RightCartridgeLowTitle = "Cartridge is low - Right";
RightCartridgeLowMsg = "The ink cartridge will need to be replaced soon. When the cartridge is empty, the printer will not print until the cartridge is replaced.";

RightCartridgeOutTitle = "Cartridge is out - Right";
RightCartridgeOutMsg = "Replace with a new HP ink cartridge. The printer will only print after the cartridge is replaced.";

OnePenDeviceCartridgeMissingName = "Cartridge missing";
OnePenDeviceCartridgeMissingTitle = "Print cartridge missing";
OnePenDeviceCartridgeMissingMsg = "The print cartridge was not detected in the printer because it was installed incorrectly, or is missing. If you have recently installed a print cartridge, make sure you have removed the protective film covering the cartridge's nozzle.";

OnePenDeviceCartridgeMisinstalledName = "Cartridge incorrectly installed";
OnePenDeviceCartridgeMisinstalledTitle = "Print cartridge incorrectly installed";
OnePenDeviceCartridgeMisinstalledMsg = "There is a problem with the print cartridge. To solve the problem:\n1. Remove the print cartridge.\n2. Reinsert the print cartridge.\nIf the problem persists, replace the print cartridge.";

OnePenDeviceCartridgeIncorrectName = "Incorrect print cartridge";
OnePenDeviceCartridgeIncorrectTitle = "Incorrect print cartridge";
OnePenDeviceCartridgeIncorrectMsg = "There is a problem with the print cartridge. The currently installed print cartridge is not intended for use in this printer. For more information on what print cartridge your printer can use, see the \"$SupplyInfoTask$\" screen.";

OnePenDeviceCartridgeErrorName = "Problem with cartridge";
OnePenDeviceCartridgeErrorTitle = "Problem with the print cartridge";
OnePenDeviceCartridgeErrorMsg = "There is a problem with the print cartridge. To solve the problem:\n1. Remove the print cartridge.\n2. Reinsert the print cartridge.\nIf the problem persists, replace the print cartridge.";

SeparatePenDeviceBlackCartridgeMissingName = "Black cartridge missing";
SeparatePenDeviceBlackCartridgeMissingTitle = "Black ink cartridge missing";
SeparatePenDeviceBlackCartridgeMissingMsg = "The black ink cartridge was not detected in the printer because it was installed incorrectly, or is missing.";

SeparatePenDeviceBlackCartridgeMisinstalledName = "Black cartridge incorrectly installed";
SeparatePenDeviceBlackCartridgeMisinstalledTitle = "Black ink cartridge incorrectly installed";
SeparatePenDeviceBlackCartridgeMisinstalledMsg = "There is a problem with the black ink cartridge. To solve the problem:\n1. Remove the ink cartridge.\n2. Reinsert the ink cartridge.\nIf the problem persists, replace the ink cartridge.";

SeparatePenDeviceBlackCartridgeIncorrectName = "Black cartridge is incorrect";
SeparatePenDeviceBlackCartridgeIncorrectTitle = "Black ink cartridge is incorrect";
SeparatePenDeviceBlackCartridgeIncorrectMsg = "There is a problem with the black ink cartridge. At least one of the ink cartridges currently installed is not intended for use in this printer. For more information on what ink cartridge your printer can use, see the \"$SupplyInfoTask$\" screen.";

SeparatePenDeviceBlackCartridgeErrorName = "Problem with black cartridge";
SeparatePenDeviceBlackCartridgeErrorTitle = "Problem with the black ink cartridge";
SeparatePenDeviceBlackCartridgeErrorMsg = "There is a problem with the black ink cartridge. To solve the problem:\n1. Remove the ink cartridge.\n2. Reinsert the ink cartridge.\nIf the problem persists, replace the ink cartridge.";

SeparatePenDeviceBlackCartridgeLowTitle = "Low ink in the black ink cartridge.";
SeparatePenDeviceBlackCartridgeLowMsg = "The ink cartridge will need to be replaced soon. When the cartridge is empty, the printer will not print until the cartridge is replaced.";

SeparatePenDeviceBlackCartridgeOutTitle = "Replace empty black ink cartridge.";
SeparatePenDeviceBlackCartridgeOutMsg = "Replace with a new HP black ink cartridge. The printer will only print after the cartridge is replaced.";

SeparatePenDeviceBlackCartridgeExpiredTitle = "Cartridge has expired - Black";
SeparatePenDeviceBlackCartridgeExpiredMsg = "The following ink cartridge is past its expiration date: Black.\nYou should remove or replace the expired cartridge now, before closing this alert message, or click OK to continue with the expired ink cartridges.\nHP cannot guarantee the quality or reliability of expired ink cartridges.\nPrinter service or repairs required as a result of using expired ink cartridges will not be covered under warranty.";

SeparatePenDeviceBlackCartridgeNonHPTitle = "Cartridge is non-HP - Black";
SeparatePenDeviceBlackCartridgeNonHPMsg = "HP cannot guarantee the quality or reliability of non-HP supplies. Printer service or repairs required as a result of using a non-HP supply will not be covered under warranty.\nIf you believe you purchased a genuine HP print cartridge, visit us at: www.hp.com/go/anticounterfeit.\nGenuine HP supplies are designed and tested with HP printers to help you easily produce great results, time after time.";

SeparatePenDeviceCyanCartridgeMissingName = "Cyan cartridge missing";
SeparatePenDeviceCyanCartridgeMissingTitle = "Cyan ink cartridge missing";
SeparatePenDeviceCyanCartridgeMissingMsg = "The cyan ink cartridge was not detected in the printer because it was installed incorrectly, or is missing.";

SeparatePenDeviceCyanCartridgeMisinstalledName = "Cyan cartridge incorrectly installed";
SeparatePenDeviceCyanCartridgeMisinstalledTitle = "Cyan ink cartridge incorrectly installed";
SeparatePenDeviceCyanCartridgeMisinstalledMsg = "There is a problem with the cyan ink cartridge. To solve the problem:\n1. Remove the ink cartridge.\n2. Reinsert the ink cartridge.\nIf the problem persists, replace the ink cartridge.";

SeparatePenDeviceCyanCartridgeIncorrectName = "Cyan cartridge is incorrect";
SeparatePenDeviceCyanCartridgeIncorrectTitle = "Cyan ink cartridge is incorrect";
SeparatePenDeviceCyanCartridgeIncorrectMsg = "There is a problem with the cyan ink cartridge. At least one of the ink cartridges currently installed is not intended for use in this printer. For more information on what ink cartridge your printer can use, see the \"$SupplyInfoTask$\" screen.";

SeparatePenDeviceCyanCartridgeErrorName = "Problem with cyan cartridge";
SeparatePenDeviceCyanCartridgeErrorTitle = "Problem with the cyan ink cartridge";
SeparatePenDeviceCyanCartridgeErrorMsg = "There is a problem with the cyan ink cartridge. To solve the problem:\n1. Remove the ink cartridge.\n2. Reinsert the ink cartridge.\nIf the problem persists, replace the ink cartridge.";

SeparatePenDeviceCyanCartridgeLowTitle = "Low ink in the cyan ink cartridge.";
SeparatePenDeviceCyanCartridgeLowMsg = "The ink cartridge will need to be replaced soon. When the cartridge is empty, the printer will not print until the cartridge is replaced.";

SeparatePenDeviceCyanCartridgeOutTitle = "Replace empty cyan ink cartridge.";
SeparatePenDeviceCyanCartridgeOutMsg = "Replace with a new HP cyan ink cartridge. The printer will only print after the cartridge is replaced.";

SeparatePenDeviceCyanCartridgeExpiredTitle = "Cartridge has expired - Cyan";
SeparatePenDeviceCyanCartridgeExpiredMsg = "The following ink cartridge is past its expiration date: Cyan.\nYou should remove or replace the expired cartridge now, before closing this alert message, or click OK to continue with the expired ink cartridges.\nHP cannot guarantee the quality or reliability of expired ink cartridges.\nPrinter service or repairs required as a result of using expired ink cartridges will not be covered under warranty.";

SeparatePenDeviceCyanCartridgeNonHPTitle = "Cartridge is non-HP - Cyan";
SeparatePenDeviceCyanCartridgeNonHPMsg = "HP cannot guarantee the quality or reliability of non-HP supplies. Printer service or repairs required as a result of using a non-HP supply will not be covered under warranty.\nIf you believe you purchased a genuine HP print cartridge, visit us at: www.hp.com/go/anticounterfeit.\nGenuine HP supplies are designed and tested with HP printers to help you easily produce great results, time after time.";

SeparatePenDeviceMagentaCartridgeMissingName = "Magenta cartridge missing";
SeparatePenDeviceMagentaCartridgeMissingTitle = "Magenta ink cartridge missing";
SeparatePenDeviceMagentaCartridgeMissingMsg = "The magenta ink cartridge was not detected in the printer because it was installed incorrectly, or is missing.";

SeparatePenDeviceMagentaCartridgeMisinstalledName = "Magenta cartridge incorrectly installed";
SeparatePenDeviceMagentaCartridgeMisinstalledTitle = "Magenta ink cartridge incorrectly installed";
SeparatePenDeviceMagentaCartridgeMisinstalledMsg = "There is a problem with the magenta ink cartridge. To solve the problem:\n1. Remove the ink cartridge.\n2. Reinsert the ink cartridge.\nIf the problem persists, replace the ink cartridge.";

SeparatePenDeviceMagentaCartridgeIncorrectName = "Magenta cartridge is incorrect";
SeparatePenDeviceMagentaCartridgeIncorrectTitle = "Magenta ink cartridge is incorrect";
SeparatePenDeviceMagentaCartridgeIncorrectMsg = "There is a problem with the magenta ink cartridge. At least one of the ink cartridges currently installed is not intended for use in this printer. For more information on what ink cartridge your printer can use, see the \"$SupplyInfoTask$\" screen.";

SeparatePenDeviceMagentaCartridgeErrorName = "Problem with magenta cartridge";
SeparatePenDeviceMagentaCartridgeErrorTitle = "Problem with the magenta ink cartridge";
SeparatePenDeviceMagentaCartridgeErrorMsg = "There is a problem with the magenta ink cartridge. To solve the problem:\n1. Remove the ink cartridge.\n2. Reinsert the ink cartridge.\nIf the problem persists, replace the ink cartridge.";

SeparatePenDeviceMagentaCartridgeLowTitle = "Low ink in the magenta ink cartridge.";
SeparatePenDeviceMagentaCartridgeLowMsg = "The ink cartridge will need to be replaced soon. When the cartridge is empty, the printer will not print until the cartridge is replaced.";

SeparatePenDeviceMagentaCartridgeOutTitle = "Replace empty magenta ink cartridge.";
SeparatePenDeviceMagentaCartridgeOutMsg = "Replace with a new HP magenta ink cartridge. The printer will only print after the cartridge is replaced.";

SeparatePenDeviceMagentaCartridgeExpiredTitle = "Cartridge has expired - Magenta";
SeparatePenDeviceMagentaCartridgeExpiredMsg = "The following ink cartridge is past its expiration date: Magenta.\nYou should remove or replace the expired cartridge now, before closing this alert message, or click OK to continue with the expired ink cartridges.\nHP cannot guarantee the quality or reliability of expired ink cartridges.\nPrinter service or repairs required as a result of using expired ink cartridges will not be covered under warranty.";

SeparatePenDeviceMagentaCartridgeNonHPTitle = "Cartridge is non-HP - Magenta";
SeparatePenDeviceMagentaCartridgeNonHPMsg = "HP cannot guarantee the quality or reliability of non-HP supplies. Printer service or repairs required as a result of using a non-HP supply will not be covered under warranty.\nIf you believe you purchased a genuine HP print cartridge, visit us at: www.hp.com/go/anticounterfeit.\nGenuine HP supplies are designed and tested with HP printers to help you easily produce great results, time after time.";

SeparatePenDeviceYellowCartridgeMissingName = "Yellow cartridge missing";
SeparatePenDeviceYellowCartridgeMissingTitle = "Yellow ink cartridge missing";
SeparatePenDeviceYellowCartridgeMissingMsg = "The yellow ink cartridge was not detected in the printer because it was installed incorrectly, or is missing.";

SeparatePenDeviceYellowCartridgeMisinstalledName = "Yellow cartridge incorrectly installed";
SeparatePenDeviceYellowCartridgeMisinstalledTitle = "Yellow ink cartridge incorrectly installed";
SeparatePenDeviceYellowCartridgeMisinstalledMsg = "There is a problem with the yellow ink cartridge. To solve the problem:\n1. Remove the ink cartridge.\n2. Reinsert the ink cartridge.\nIf the problem persists, replace the ink cartridge.";

SeparatePenDeviceYellowCartridgeIncorrectName = "Yellow cartridge is incorrect";
SeparatePenDeviceYellowCartridgeIncorrectTitle = "Yellow ink cartridge is incorrect";
SeparatePenDeviceYellowCartridgeIncorrectMsg = "There is a problem with the yellow ink cartridge. At least one of the ink cartridges currently installed is not intended for use in this printer. For more information on what ink cartridge your printer can use, see the \"$SupplyInfoTask$\" screen.";

SeparatePenDeviceYellowCartridgeErrorName = "Problem with yellow cartridge";
SeparatePenDeviceYellowCartridgeErrorTitle = "Problem with the yellow ink cartridge";
SeparatePenDeviceYellowCartridgeErrorMsg = "There is a problem with the yellow ink cartridge. To solve the problem:\n1. Remove the ink cartridge.\n2. Reinsert the ink cartridge.\nIf the problem persists, replace the ink cartridge.";

SeparatePenDeviceYellowCartridgeLowTitle = "Low ink in the yellow ink cartridge.";
SeparatePenDeviceYellowCartridgeLowMsg = "The ink cartridge will need to be replaced soon. When the cartridge is empty, the printer will not print until the cartridge is replaced.";

SeparatePenDeviceYellowCartridgeOutTitle = "Replace empty yellow ink cartridge.";
SeparatePenDeviceYellowCartridgeOutMsg = "Replace with a new HP yellow ink cartridge. The printer will only print after the cartridge is replaced.";

SeparatePenDeviceYellowCartridgeExpiredTitle = "Cartridge has expired - Yellow";
SeparatePenDeviceYellowCartridgeExpiredMsg = "The following ink cartridge is past its expiration date: Yellow.\nYou should remove or replace the expired cartridge now, before closing this alert message, or click OK to continue with the expired ink cartridges.\nHP cannot guarantee the quality or reliability of expired ink cartridges.\nPrinter service or repairs required as a result of using expired ink cartridges will not be covered under warranty.";

SeparatePenDeviceYellowCartridgeNonHPTitle = "Cartridge is non-HP - Yellow";
SeparatePenDeviceYellowCartridgeNonHPMsg = "HP cannot guarantee the quality or reliability of non-HP supplies. Printer service or repairs required as a result of using a non-HP supply will not be covered under warranty.\nIf you believe you purchased a genuine HP print cartridge, visit us at: www.hp.com/go/anticounterfeit.\nGenuine HP supplies are designed and tested with HP printers to help you easily produce great results, time after time.";

SeparatePenDeviceLightCyanCartridgeMissingName = "Light cyan cartridge missing";
SeparatePenDeviceLightCyanCartridgeMissingTitle = "Light cyan ink cartridge missing";
SeparatePenDeviceLightCyanCartridgeMissingMsg = "The light cyan ink cartridge was not detected in the printer because it was installed incorrectly, or is missing.";

SeparatePenDeviceLightCyanCartridgeMisinstalledName = "Light cyan cartridge incorrectly installed";
SeparatePenDeviceLightCyanCartridgeMisinstalledTitle = "Light cyan ink cartridge incorrectly installed";
SeparatePenDeviceLightCyanCartridgeMisinstalledMsg = "There is a problem with the light cyan ink cartridge. To solve the problem:\n1. Remove the ink cartridge.\n2. Reinsert the ink cartridge.\nIf the problem persists, replace the ink cartridge.";

SeparatePenDeviceLightCyanCartridgeIncorrectName = "Light cyan cartridge is incorrect";
SeparatePenDeviceLightCyanCartridgeIncorrectTitle = "Light cyan ink cartridge is incorrect";
SeparatePenDeviceLightCyanCartridgeIncorrectMsg = "There is a problem with the light cyan ink cartridge. At least one of the ink cartridges currently installed is not intended for use in this printer. For more information on what ink cartridge your printer can use, see the \"$SupplyInfoTask$\" screen.";

SeparatePenDeviceLightCyanCartridgeErrorName = "Problem with light cyan cartridge";
SeparatePenDeviceLightCyanCartridgeErrorTitle = "Problem with the light cyan ink cartridge";
SeparatePenDeviceLightCyanCartridgeErrorMsg = "There is a problem with the light cyan ink cartridge. To solve the problem:\n1. Remove the ink cartridge.\n2. Reinsert the ink cartridge.\nIf the problem persists, replace the ink cartridge.";

SeparatePenDeviceLightCyanCartridgeLowTitle = "Low ink in the light cyan ink cartridge.";
SeparatePenDeviceLightCyanCartridgeLowMsg = "The ink cartridge will need to be replaced soon. When the cartridge is empty, the printer will not print until the cartridge is replaced.";

SeparatePenDeviceLightCyanCartridgeOutTitle = "Replace empty light cyan ink cartridge.";
SeparatePenDeviceLightCyanCartridgeOutMsg = "Replace with a new HP light cyan ink cartridge. The printer will only print after the cartridge is replaced.";

SeparatePenDeviceLightCyanCartridgeExpiredTitle = "Cartridge has expired - Light cyan";
SeparatePenDeviceLightCyanCartridgeExpiredMsg = "The following ink cartridge is past its expiration date: Light cyan.\nYou should remove or replace the expired cartridge now, before closing this alert message, or click OK to continue with the expired ink cartridges.\nHP cannot guarantee the quality or reliability of expired ink cartridges.\nPrinter service or repairs required as a result of using expired ink cartridges will not be covered under warranty.";

SeparatePenDeviceLightCyanCartridgeNonHPTitle = "Cartridge is non-HP - Light cyan";
SeparatePenDeviceLightCyanCartridgeNonHPMsg = "HP cannot guarantee the quality or reliability of non-HP supplies. Printer service or repairs required as a result of using a non-HP supply will not be covered under warranty.\nIf you believe you purchased a genuine HP print cartridge, visit us at: www.hp.com/go/anticounterfeit.\nGenuine HP supplies are designed and tested with HP printers to help you easily produce great results, time after time.";

SeparatePenDeviceLightMagentaCartridgeMissingName = "Light magenta cartridge missing";
SeparatePenDeviceLightMagentaCartridgeMissingTitle = "Light magenta ink cartridge missing";
SeparatePenDeviceLightMagentaCartridgeMissingMsg = "The light magenta ink cartridge was not detected in the printer because it was installed incorrectly, or is missing.";

SeparatePenDeviceLightMagentaCartridgeMisinstalledName = "Light magenta cartridge incorrectly installed";
SeparatePenDeviceLightMagentaCartridgeMisinstalledTitle = "Light magenta ink cartridge incorrectly installed";
SeparatePenDeviceLightMagentaCartridgeMisinstalledMsg = "There is a problem with the light magenta ink cartridge. To solve the problem:\n1. Remove the ink cartridge.\n2. Reinsert the ink cartridge.\nIf the problem persists, replace the ink cartridge.";

SeparatePenDeviceLightMagentaCartridgeIncorrectName = "Light magenta cartridge is incorrect";
SeparatePenDeviceLightMagentaCartridgeIncorrectTitle = "Light magenta ink cartridge is incorrect";
SeparatePenDeviceLightMagentaCartridgeIncorrectMsg = "There is a problem with the light magenta ink cartridge. At least one of the ink cartridges currently installed is not intended for use in this printer. For more information on what ink cartridge your printer can use, see the \"$SupplyInfoTask$\" screen.";

SeparatePenDeviceLightMagentaCartridgeErrorName = "Problem with light magenta cartridge";
SeparatePenDeviceLightMagentaCartridgeErrorTitle = "Problem with the light magenta ink cartridge";
SeparatePenDeviceLightMagentaCartridgeErrorMsg = "There is a problem with the light magenta ink cartridge. To solve the problem:\n1. Remove the ink cartridge.\n2. Reinsert the ink cartridge.\nIf the problem persists, replace the ink cartridge.";

SeparatePenDeviceLightMagentaCartridgeLowTitle = "Low ink in the light magenta ink cartridge.";
SeparatePenDeviceLightMagentaCartridgeLowMsg = "The ink cartridge will need to be replaced soon. When the cartridge is empty, the printer will not print until the cartridge is replaced.";

SeparatePenDeviceLightMagentaCartridgeOutTitle = "Replace empty light magenta ink cartridge.";
SeparatePenDeviceLightMagentaCartridgeOutMsg = "Replace with a new HP light magenta ink cartridge. The printer will only print after the cartridge is replaced.";

SeparatePenDeviceLightMagentaCartridgeExpiredTitle = "Cartridge has expired - Light magenta";
SeparatePenDeviceLightMagentaCartridgeExpiredMsg = "The following ink cartridge is past its expiration date: Light magenta.\nYou should remove or replace the expired cartridge now, before closing this alert message, or click OK to continue with the expired ink cartridges.\nHP cannot guarantee the quality or reliability of expired ink cartridges.\nPrinter service or repairs required as a result of using expired ink cartridges will not be covered under warranty.";

SeparatePenDeviceLightMagentaCartridgeNonHPTitle = "Cartridge is non-HP - Light magenta";
SeparatePenDeviceLightMagentaCartridgeNonHPMsg = "HP cannot guarantee the quality or reliability of non-HP supplies. Printer service or repairs required as a result of using a non-HP supply will not be covered under warranty.\nIf you believe you purchased a genuine HP print cartridge, visit us at: www.hp.com/go/anticounterfeit.\nGenuine HP supplies are designed and tested with HP printers to help you easily produce great results, time after time.";

SeparatePenDeviceMatteBlackCartridgeMissingTitle = "Matte black ink cartridge missing.";
SeparatePenDeviceMatteBlackCartridgeMissingMsg = "The matte black ink cartridge was not detected in the printer because it was installed incorrectly, or is missing.";

SeparatePenDeviceMatteBlackCartridgeMisinstalledTitle = "Matte black ink cartridge incorrectly installed.";
SeparatePenDeviceMatteBlackCartridgeMisinstalledMsg = "There is a problem with the matte black ink cartridge. To solve the problem:\n1. Remove the ink cartridge.\n2. Reinsert the ink cartridge.\nIf the problem persists, replace the ink cartridge.";

SeparatePenDeviceMatteBlackCartridgeIncorrectTitle = "Matte black ink cartridge is incorrect.";
SeparatePenDeviceMatteBlackCartridgeIncorrectMsg = "There is a problem with the matte black ink cartridge. At least one of the ink cartridges currently installed is not intended for use in this printer. For more information on what ink cartridge your printer can use, see the \"$SupplyInfoTask$\" screen.";

SeparatePenDeviceMatteBlackCartridgeErrorTitle = "Problem with the matte black ink cartridge.";
SeparatePenDeviceMatteBlackCartridgeErrorMsg = "There is a problem with the matte black ink cartridge. To solve the problem:\n1. Remove the ink cartridge.\n2. Reinsert the ink cartridge.\nIf the problem persists, replace the ink cartridge.";

SeparatePenDeviceMatteBlackCartridgeLowTitle = "Low ink in the matte black ink cartridge.";
SeparatePenDeviceMatteBlackCartridgeLowMsg = "The ink cartridge will need to be replaced soon. When the cartridge is empty, the printer will not print until the cartridge is replaced.";

SeparatePenDeviceMatteBlackCartridgeOutTitle = "Replace empty matte black ink cartridge.";
SeparatePenDeviceMatteBlackCartridgeOutMsg = "Replace with a new HP matte black ink cartridge. The printer will only print after the cartridge is replaced.";

SeparatePenDevicePhotoBlackCartridgeMissingTitle = "Photo black ink cartridge missing.";
SeparatePenDevicePhotoBlackCartridgeMissingMsg = "The photo black ink cartridge was not detected in the printer because it was installed incorrectly, or is missing.";

SeparatePenDevicePhotoBlackCartridgeMisinstalledTitle = "Photo black ink cartridge incorrectly installed.";
SeparatePenDevicePhotoBlackCartridgeMisinstalledMsg = "There is a problem with the photo black ink cartridge. To solve the problem:\n1. Remove the ink cartridge.\n2. Reinsert the ink cartridge.\nIf the problem persists, replace the ink cartridge.";

SeparatePenDevicePhotoBlackCartridgeIncorrectTitle = "Photo black ink cartridge is incorrect.";
SeparatePenDevicePhotoBlackCartridgeIncorrectMsg = "There is a problem with the photo black ink cartridge. At least one of the ink cartridges currently installed is not intended for use in this printer. For more information on what ink cartridge your printer can use, see the \"$SupplyInfoTask$\" screen.";

SeparatePenDevicePhotoBlackCartridgeErrorTitle = "Problem with the photo black ink cartridge.";
SeparatePenDevicePhotoBlackCartridgeErrorMsg = "There is a problem with the photo black ink cartridge. To solve the problem:\n1. Remove the ink cartridge.\n2. Reinsert the ink cartridge.\nIf the problem persists, replace the ink cartridge.";

SeparatePenDevicePhotoBlackCartridgeLowTitle = "Low ink in the photo black ink cartridge.";
SeparatePenDevicePhotoBlackCartridgeLowMsg = "The ink cartridge will need to be replaced soon. When the cartridge is empty, the printer will not print until the cartridge is replaced.";

SeparatePenDevicePhotoBlackCartridgeOutTitle = "Replace empty photo black ink cartridge.";
SeparatePenDevicePhotoBlackCartridgeOutMsg = "Replace with a new HP photo black ink cartridge. The printer will only print after the cartridge is replaced.";

SeparatePenDeviceLightGrayCartridgeMissingTitle = "Light gray ink cartridge missing.";
SeparatePenDeviceLightGrayCartridgeMissingMsg = "The light gray ink cartridge was not detected in the printer because it was installed incorrectly, or is missing.";

SeparatePenDeviceLightGrayCartridgeMisinstalledTitle = "Light gray ink cartridge incorrectly installed.";
SeparatePenDeviceLightGrayCartridgeMisinstalledMsg = "There is a problem with the light gray ink cartridge. To solve the problem:\n1. Remove the ink cartridge.\n2. Reinsert the ink cartridge.\nIf the problem persists, replace the ink cartridge.";

SeparatePenDeviceLightGrayCartridgeIncorrectTitle = "Light gray ink cartridge is incorrect.";
SeparatePenDeviceLightGrayCartridgeIncorrectMsg = "There is a problem with the light gray ink cartridge. At least one of the ink cartridges currently installed is not intended for use in this printer. For more information on what ink cartridge your printer can use, see the \"$SupplyInfoTask$\" screen.";

SeparatePenDeviceLightGrayCartridgeErrorTitle = "Problem with the light gray ink cartridge.";
SeparatePenDeviceLightGrayCartridgeErrorMsg = "There is a problem with the light gray ink cartridge. To solve the problem:\n1. Remove the ink cartridge.\n2. Reinsert the ink cartridge.\nIf the problem persists, replace the ink cartridge.";

SeparatePenDeviceLightGrayCartridgeLowTitle = "Low ink in the light gray ink cartridge.";
SeparatePenDeviceLightGrayCartridgeLowMsg = "The ink cartridge will need to be replaced soon. When the cartridge is empty, the printer will not print until the cartridge is replaced.";

SeparatePenDeviceLightGrayCartridgeOutTitle = "Replace empty light gray ink cartridge.";
SeparatePenDeviceLightGrayCartridgeOutMsg = "Replace with a new HP light gray ink cartridge. The printer will only print after the cartridge is replaced.";

//printheads
SeparatePenDeviceBlackYellowPrintHeadMissingTitle = "Install black and yellow printhead";
SeparatePenDeviceBlackYellowPrintHeadMissingMsg = "Install an HP black and yellow printhead.\nIt is either missing or not installed correctly.";

SeparatePenDeviceCyanMagentaPrintHeadMissingTitle = "Install magenta and cyan printhead";
SeparatePenDeviceCyanMagentaPrintHeadMissingMsg = "Install an HP magenta and cyan printhead.\nIt is either missing or not installed correctly.";

SeparatePenDeviceBlackPrintHeadMissingTitle = "Install black printhead";
SeparatePenDeviceBlackPrintHeadMissingMsg = "Install a HP black printhead.\nIt is either missing or not installed correctly.";

SeparatePenDeviceCyanPrintHeadMissingTitle = "Install cyan printhead";
SeparatePenDeviceCyanPrintHeadMissingMsg = "Install a HP cyan printhead.\nIt is either missing or not installed correctly.";

SeparatePenDeviceMagentaPrintHeadMissingTitle = "Install magenta printhead";
SeparatePenDeviceMagentaPrintHeadMissingMsg = "Install a HP magenta printhead.\nIt is either missing or not installed correctly.";

SeparatePenDeviceYellowPrintHeadMissingTitle = "Install yellow printhead";
SeparatePenDeviceYellowPrintHeadMissingMsg = "Install a HP yellow printhead.\nIt is either missing or not installed correctly.";

SeparatePenDeviceMagentaYellowPrintHeadMissingTitle = "Install magenta and yellow printhead.";
SeparatePenDeviceMagentaYellowPrintHeadMissingMsg = "Install a HP magenta and yellow printhead. It is either missing or not installed correctly.";

SeparatePenDeviceMatteBlackCyanPrintHeadMissingTitle = "Install matte black and cyan printhead.";
SeparatePenDeviceMatteBlackCyanPrintHeadMissingMsg = "Install a HP matte black and cyan printhead. It is either missing or not installed correctly.";

SeparatePenDeviceLightMagentaLightCyanPrintHeadMissingTitle = "Install light magenta and light cyan printhead.";
SeparatePenDeviceLightMagentaLightCyanPrintHeadMissingMsg = "Install a HP light magenta and light cyan printhead. It is either missing or not installed correctly.";

SeparatePenDevicePhotoBlackLightGrayPrintHeadMissingTitle = "Install photo black and light gray printhead.";
SeparatePenDevicePhotoBlackLightGrayPrintHeadMissingMsg = "Install a HP photo black and light gray printhead. It is either missing or not installed correctly.";

LaserjetDeviceBlackCartridgeMissingName = "Black toner cartridge is missing";
LaserjetDeviceBlackCartridgeMissingTitle = "Black cartridge is missing";
LaserjetDeviceBlackCartridgeMissingMsg = "Please install black toner cartridge to continue printing.";

LaserjetDeviceCyanCartridgeMissingName = "Cyan toner cartridge is missing";
LaserjetDeviceCyanCartridgeMissingTitle = "Cyan cartridge is missing";
LaserjetDeviceCyanCartridgeMissingMsg = "Please install cyan toner cartridge to continue printing.";

LaserjetDeviceMagentaCartridgeMissingName = "Magenta toner cartridge is missing";
LaserjetDeviceMagentaCartridgeMissingTitle = "Magenta cartridge is missing";
LaserjetDeviceMagentaCartridgeMissingMsg = "Please install magenta toner cartridge to continue printing.";

LaserjetDeviceYellowCartridgeMissingName = "Yellow toner cartridge is missing";
LaserjetDeviceYellowCartridgeMissingTitle = "Yellow cartridge is missing";
LaserjetDeviceYellowCartridgeMissingMsg = "Please install yellow toner cartridge to continue printing.";

LaserjetDeviceFuserKitMissingName = "Fuser Kit is missing";
LaserjetDeviceFuserKitMissingTitle = "Fuser Kit is missing";
LaserjetDeviceFuserKitMissingMsg = "Please install Fuser Kit to continue printing.";

LaserjetDeviceImageDrumMissingTitle = "Imaging drum is missing";
LaserjetDeviceImageDrumMissingMsg = "Please install the imaging drum to continue printing.";

SuppliesStatusAuthentic = "Genuine HP";
SuppliesStatusClone = "Non-HP clone chip";
SuppliesStatusRefilled = "Non-HP refilled";
SuppliesStatusUnauthorized = "Unauthorized";
SuppliesStatusGood = "Good";
SuppliesStatusMissing = "Missing";
SuppliesStatusMisinstalled = "Incorrectly installed";
SuppliesStatusIncorrect = "Incorrect";
SuppliesStatusError = "Need replace";
SuppliesStatusUnknown = "Unknown";
SuppliesStatusLow = "Low";
SuppliesStatusOut = "Out";
SupplyLevelVeryLow = "Very Low";
SupplyAuthStateUsed = "Used";
SupplyAuthStateUnsupported = "Unsupported";
SupplyAuthStateNonHP = "Non-HP";
SupplyAuthStateIncompatible = "Incompatible";
SuppliesStatusSubscriptionConsumableTemporaryUsageAllowed = "Instant ink";
SuppliesStatusSehoAtInsertion = "Empty Cartridge";

// Ink strings
SuppliesStatusBothCartridgeName = "Both";
SuppliesStatusBothCartridgesMissing = "Both Ink Cartridges Missing";

InkStatusNearExpiration = "Cartridge is near expiration";
InkStatusIncorrect = "Cartridge is incorrect";
InkStatusError = "Cartridge has failed";
InkStatusLow = "Cartridge is low";
InkStatusOut = "Cartridge is out";
InkStatusExpired = "Cartridge has expired";
InkStatusNonHP = "Cartridge is non-HP";
InkStatusPreviouslyUsed = "Cartridge is previously used";
InkStatusDepleted = "Used, Refilled or Counterfeit";
InkStatusMissing = "Cartridge is missing";
InkStatusVeryLow = "Very low on ink";

InkStatusUpgradableSupply = "Upgrade Cartridge";
InkStatusSupplyUpgradeSuccess = "Upgrade Successful";
InkStatusSupplyUpgradeFailed = "Upgrade Not Successful";

CartridgeStatusWrongSlot = "Cartridge is installed in wrong slot";
CartridgeStatusMissing = "Cartridge is missing";
TonerMissingName = "Cartridge Missing";
DrumMissingName = "Drum Missing";
CartridgeStatusIncorrect = "Cartridge is incorrect";
CartridgeStatusIncompatible = "Cartridge is incompatible";
CartridgeStatusError = "Cartridge has failed";
CartridgeStatusLow = "Cartridge is low";
CartridgeStatusOut = "Cartridge is out";
CartridgeStatusExpired = "Cartridge has expired";
CartridgeStatusNonHP = "Cartridge is non-HP";
CartridgeStatusDepleted = "Cartridge is depleted";
CartridgeStatusPreviouslyUsed = "Cartridge is previously used";
CartridgeStatusProtected = "Cartridge is protected";
DrumStatusProtectedName = "Drum is protected";
CartridgeIsEmpty = "Cartridge is empty";
CartridgeEmptyNotDetected = "Empty condition not detected";
CartridgePossibleRefill = "Possible refill";
CartridgeStatusUnauthorized = "Cartridge is unauthorized";

InkSensorFailure = "Ink sensor failure";

PrintheadStatusMissing = "Printhead is missing";
PrintheadStatusMisinstalled = "Printhead is defective";
PrintheadStatusIncorrect = "Printhead is incompatible";
PrintheadStatusError = "Printhead has failed";

MissingSmartChipColorSupply = "10.10.%@ Supply memory error";
MissingSmartChipMonoSupply = "Supply memory error";
BadDataFromCartridgeColorSupply = "10.00.%@ Supply memory error";
BadDataFromCartridgeMonoSupply = "Supply memory warning";

//StatusAlert.nib
AlertWindowTitle = "Printer Status";
ErrorConditionsTitle = "The following error conditions have been detected on your printer:";
ExplanationTitle = "Please select the error name in the list above to get the explanation/advice.";
AlertButtonOk = "OK";

InputTrayOverLoadedName = "Paper Tray Problem";
NeedsEnrollmentName = "Cartridge needs enrollment";

InkCartridgesDepletedName = "Ink cartridges depleted";
CartridgesDepletedName = "Cartridges Depleted";
ReplaceTonerOutName = "Replace Cartridge";
ReplaceDrumOutName = "Replace Drum";


